#+EXPORT_FILE_NAME: ~/Dropbox/the_range/projects/language_tour.html
#+OPTIONS: toc:1 html-style:nil
#+PROPERY: header-args: :eval never :exports code

**** Installing Quicklisp
First, we get the files we need:
#+BEGIN_SRC shell
curl -O https://beta.quicklisp.org/quicklisp.lisp
curl -O https://beta.quicklisp.org/quicklisp.lisp.asc
#+END_SRC

Let's make sure we got the right thing:
#+BEGIN_SRC shell
gpg --verify quicklisp.lisp.asc quicklisp.lisp ^&1
#+END_SRC

#+RESULTS:
: gpg: Signature made Wed Jan 28 13:13:26 2015 PST using RSA key ID 028B5FF7
: gpg: Good signature from "Quicklisp Release Signing Key <release@quicklisp.org>" [unknown]
: gpg: WARNING: This key is not certified with a trusted signature!
: gpg:          There is no indication that the signature belongs to the owner.
: Primary key fingerprint: D7A3 489D DEFE 32B7 D0E7  CC61 3079 65AB 028B 5FF7

Probably good enough.

#+BEGIN_SRC shell :eval never
sbcl --load quicklisp.lisp
#+END_SRC


